{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "DroneOps",
			"Children": [
				{
					"Source": {
						"Text": "+ New security plan"
					},
					"Translation": {
						"Text": "＋ 新建安保方案"
					},
					"Key": "Workflow.NewPlan"
				},
				{
					"Source": {
						"Text": "2D SITUATION MAP"
					},
					"Translation": {
						"Text": "二维态势地图"
					},
					"Key": "Situation.Title"
				},
				{
					"Source": {
						"Text": "2D TACTICAL MAP | Z{0} | {1} UAV without GPS"
					},
					"Translation": {
						"Text": "二维态势地图 | Z{0} | {1} 架无人机无 GPS"
					},
					"Key": "Tactical.Header"
				},
				{
					"Source": {
						"Text": "4 VIEW"
					},
					"Translation": {
						"Text": "4 格布局"
					},
					"Key": "Video.Four"
				},
				{
					"Source": {
						"Text": "6 VIEW"
					},
					"Translation": {
						"Text": "6 格布局"
					},
					"Key": "Video.Six"
				},
				{
					"Source": {
						"Text": "A group member failed; the entire mission group has failed and active members were asked to hold."
					},
					"Translation": {
						"Text": "组内成员失败，整组任务已失败，并已请求活动成员保持位置。"
					},
					"Key": "Errors.GROUP_MEMBER_FAILED"
				},
				{
					"Source": {
						"Text": "A simulated mission is active. Shutdown will persist it as paused and stop local simulation. Continue?"
					},
					"Translation": {
						"Text": "当前存在正在执行的模拟任务。关闭系统将持久化为暂停状态并停止本地模拟。是否继续关闭？"
					},
					"Key": "Execution.ShutdownConfirm"
				},
				{
					"Source": {
						"Text": "ACTIVE"
					},
					"Translation": {
						"Text": "当前"
					},
					"Key": "Tactical.Active"
				},
				{
					"Source": {
						"Text": "ADD TASK"
					},
					"Translation": {
						"Text": "添加任务"
					},
					"Key": "Plan.AddMission"
				},
				{
					"Source": {
						"Text": "ADD WAYPOINT"
					},
					"Translation": {
						"Text": "添加航点"
					},
					"Key": "Map.Add"
				},
				{
					"Source": {
						"Text": "AGL: above ground (unchecked: ellipsoid)"
					},
					"Translation": {
						"Text": "AGL 相对地面高度（不勾选：椭球高）"
					},
					"Key": "Mission3D.AGL"
				},
				{
					"Source": {
						"Text": "AI DETECTION"
					},
					"Translation": {
						"Text": "智能检测"
					},
					"Key": "Video.AI"
				},
				{
					"Source": {
						"Text": "AI DETECTION NOT CONNECTED"
					},
					"Translation": {
						"Text": "智能检测未连接"
					},
					"Key": "Video.AINotConnected"
				},
				{
					"Source": {
						"Text": "AIRCRAFT"
					},
					"Translation": {
						"Text": "无人机列表"
					},
					"Key": "Video.Aircraft"
				},
				{
					"Source": {
						"Text": "ALERT"
					},
					"Translation": {
						"Text": "告警"
					},
					"Key": "Status.ALERT"
				},
				{
					"Source": {
						"Text": "ALERT"
					},
					"Translation": {
						"Text": "告警"
					},
					"Key": "Tactical.Alert"
				},
				{
					"Source": {
						"Text": "ALERT FILTER"
					},
					"Translation": {
						"Text": "告警筛选"
					},
					"Key": "Status.ALERT_FILTER"
				},
				{
					"Source": {
						"Text": "ALERTS · Last 200 / Session"
					},
					"Translation": {
						"Text": "告警中心 · 最近200条 / 本会话"
					},
					"Key": "Command.Alerts"
				},
				{
					"Source": {
						"Text": "ALERT_RESPONSE"
					},
					"Translation": {
						"Text": "告警响应"
					},
					"Key": "Status.ALERT_RESPONSE"
				},
				{
					"Source": {
						"Text": "ALL"
					},
					"Translation": {
						"Text": "全部"
					},
					"Key": "Log.All"
				},
				{
					"Source": {
						"Text": "ALL"
					},
					"Translation": {
						"Text": "全部"
					},
					"Key": "Status.ALL"
				},
				{
					"Source": {
						"Text": "ALT N/A | SPD N/A | BAT N/A"
					},
					"Translation": {
						"Text": "高度 暂无 | 速度 暂无 | 电量 暂无"
					},
					"Key": "Command.NoMetrics"
				},
				{
					"Source": {
						"Text": "ALT {0} | SPD {1} | BAT {2}"
					},
					"Translation": {
						"Text": "高度 {0} | 速度 {1} | 电量 {2}"
					},
					"Key": "Command.Metrics"
				},
				{
					"Source": {
						"Text": "APPLY WAYPOINT PARAMETERS"
					},
					"Translation": {
						"Text": "应用航点参数"
					},
					"Key": "Mission3D.Apply"
				},
				{
					"Source": {
						"Text": "ASSIGN UAV"
					},
					"Translation": {
						"Text": "分配无人机"
					},
					"Key": "Plan.Assign"
				},
				{
					"Source": {
						"Text": "Abort mission"
					},
					"Translation": {
						"Text": "终止任务"
					},
					"Key": "Execution.Abort"
				},
				{
					"Source": {
						"Text": "Active UAV changed: {target}"
					},
					"Translation": {
						"Text": "当前无人机已切换：{target}"
					},
					"Key": "Events.active_uav_changed"
				},
				{
					"Source": {
						"Text": "Adapter position is not a valid WGS84 coordinate."
					},
					"Translation": {
						"Text": "适配器位置不是有效的 WGS84 坐标。"
					},
					"Key": "Errors.ADAPTER_POSITION_INVALID"
				},
				{
					"Source": {
						"Text": "Add at least one mission."
					},
					"Translation": {
						"Text": "请至少添加一个任务。"
					},
					"Key": "Errors.NO_MISSIONS"
				},
				{
					"Source": {
						"Text": "Adjust the map view before editing."
					},
					"Translation": {
						"Text": "请先调整地图范围，再开始航线编辑"
					},
					"Key": "Map.AdjustBeforeEdit"
				},
				{
					"Source": {
						"Text": "Alert selected: {target}"
					},
					"Translation": {
						"Text": "已选择告警：{target}"
					},
					"Key": "Events.alert_selected"
				},
				{
					"Source": {
						"Text": "Alerts"
					},
					"Translation": {
						"Text": "告警"
					},
					"Key": "Nav.Alerts"
				},
				{
					"Source": {
						"Text": "All waypoints completed"
					},
					"Translation": {
						"Text": "全部航点已完成"
					},
					"Key": "Execution.ROUTE_FINISHED"
				},
				{
					"Source": {
						"Text": "Altitude (m)"
					},
					"Translation": {
						"Text": "高度（米）"
					},
					"Key": "Mission3D.Altitude"
				},
				{
					"Source": {
						"Text": "Altitude reference"
					},
					"Translation": {
						"Text": "高度基准"
					},
					"Key": "Inspector.Reference"
				},
				{
					"Source": {
						"Text": "Another controller owns the aircraft."
					},
					"Translation": {
						"Text": "另一控制器正在使用无人机。"
					},
					"Key": "Errors.LEGACY_CONTROLLER_BUSY"
				},
				{
					"Source": {
						"Text": "Another editor owns this route session."
					},
					"Translation": {
						"Text": "其他编辑器正在使用该编辑会话。"
					},
					"Key": "Errors.EDIT_SESSION_CONFLICT"
				},
				{
					"Source": {
						"Text": "Area selected: {target}"
					},
					"Translation": {
						"Text": "已选择区域：{target}"
					},
					"Key": "Events.active_area_id_changed"
				},
				{
					"Source": {
						"Text": "Arrange Windows"
					},
					"Translation": {
						"Text": "排列窗口"
					},
					"Key": "Launcher.Arrange"
				},
				{
					"Source": {
						"Text": "Assign a UAV to this mission."
					},
					"Translation": {
						"Text": "请为该任务分配无人机。"
					},
					"Key": "Errors.NO_UAV_ASSIGNED"
				},
				{
					"Source": {
						"Text": "Assigned UAV"
					},
					"Translation": {
						"Text": "执行无人机"
					},
					"Key": "Workflow.AssignedUAV"
				},
				{
					"Source": {
						"Text": "Available target area radius (m)"
					},
					"Translation": {
						"Text": "目标可用区域半径（米）"
					},
					"Key": "Group.Area"
				},
				{
					"Source": {
						"Text": "BACKEND OFFLINE / RECONNECTING"
					},
					"Translation": {
						"Text": "后端离线 / 正在重连"
					},
					"Key": "Stage1.System.OFFLINE"
				},
				{
					"Source": {
						"Text": "BACKEND {0} | SYNC {1} | ACTIVE {2} | v{3}"
					},
					"Translation": {
						"Text": "后端 {0} | 同步 {1} | 当前 {2} | v{3}"
					},
					"Key": "Common.Sync"
				},
				{
					"Source": {
						"Text": "BEGIN ROUTE EDIT"
					},
					"Translation": {
						"Text": "开始编辑航线"
					},
					"Key": "Map.Begin"
				},
				{
					"Source": {
						"Text": "Back to security plans"
					},
					"Translation": {
						"Text": "← 安保方案"
					},
					"Key": "Workflow.BackPlans"
				},
				{
					"Source": {
						"Text": "Backend confirmed"
					},
					"Translation": {
						"Text": "后端已确认"
					},
					"Key": "Common.Confirmed"
				},
				{
					"Source": {
						"Text": "Backend connected"
					},
					"Translation": {
						"Text": "后端已连接"
					},
					"Key": "Events.backend_connected"
				},
				{
					"Source": {
						"Text": "Backend disconnected"
					},
					"Translation": {
						"Text": "后端已断开"
					},
					"Key": "Events.backend_disconnected"
				},
				{
					"Source": {
						"Text": "Backend offline. No change submitted."
					},
					"Translation": {
						"Text": "后端离线，未提交修改。"
					},
					"Key": "Errors.SYNC_OFFLINE"
				},
				{
					"Source": {
						"Text": "Backend reconnected"
					},
					"Translation": {
						"Text": "后端已重连"
					},
					"Key": "Events.backend_reconnected"
				},
				{
					"Source": {
						"Text": "Backend: {0}   ·   Map: {1}"
					},
					"Translation": {
						"Text": "Backend：{0}   ·   Map：{1}"
					},
					"Key": "Workflow.Readiness"
				},
				{
					"Source": {
						"Text": "Basic information"
					},
					"Translation": {
						"Text": "基本信息"
					},
					"Key": "Workflow.BasicInfo"
				},
				{
					"Source": {
						"Text": "Blocking issues"
					},
					"Translation": {
						"Text": "阻塞问题"
					},
					"Key": "Plan.Blocking"
				},
				{
					"Source": {
						"Text": "CANCEL"
					},
					"Translation": {
						"Text": "取消"
					},
					"Key": "Common.Cancel"
				},
				{
					"Source": {
						"Text": "CANCEL SCHEDULE"
					},
					"Translation": {
						"Text": "取消定时任务"
					},
					"Key": "Schedule.Cancel"
				},
				{
					"Source": {
						"Text": "CANCELLED"
					},
					"Translation": {
						"Text": "已取消"
					},
					"Key": "Execution.CANCELLED"
				},
				{
					"Source": {
						"Text": "CHECK CONFIGURATION"
					},
					"Translation": {
						"Text": "检查配置"
					},
					"Key": "Plan.Check"
				},
				{
					"Source": {
						"Text": "CLEAR DISPLAY"
					},
					"Translation": {
						"Text": "清空显示"
					},
					"Key": "Log.Clear"
				},
				{
					"Source": {
						"Text": "CLEAR ROUTE"
					},
					"Translation": {
						"Text": "清空航线"
					},
					"Key": "Map.Clear"
				},
				{
					"Source": {
						"Text": "CLOSED"
					},
					"Translation": {
						"Text": "已关闭"
					},
					"Key": "Status.CLOSED"
				},
				{
					"Source": {
						"Text": "COLLAPSE"
					},
					"Translation": {
						"Text": "收起"
					},
					"Key": "Common.Collapse"
				},
				{
					"Source": {
						"Text": "COMMAND CENTER"
					},
					"Translation": {
						"Text": "指挥中心"
					},
					"Key": "Stage1.Command"
				},
				{
					"Source": {
						"Text": "COMMAND CENTER | {0} | {1} | Clients {2}/3"
					},
					"Translation": {
						"Text": "指挥中心 | {0} | {1} | 客户端 {2}/3"
					},
					"Key": "Command.Header"
				},
				{
					"Source": {
						"Text": "CONFIGURATION VALID"
					},
					"Translation": {
						"Text": "配置有效"
					},
					"Key": "Plan.READY"
				},
				{
					"Source": {
						"Text": "CONFIRM DEPLOY"
					},
					"Translation": {
						"Text": "确认部署"
					},
					"Key": "Plan.ConfirmDeploy"
				},
				{
					"Source": {
						"Text": "CONFIRM REVIEW"
					},
					"Translation": {
						"Text": "确认审阅"
					},
					"Key": "Plan.ConfirmReview"
				},
				{
					"Source": {
						"Text": "CONNECTED"
					},
					"Translation": {
						"Text": "已连接"
					},
					"Key": "Common.Connected"
				},
				{
					"Source": {
						"Text": "CONNECTED TO EXISTING INSTANCE"
					},
					"Translation": {
						"Text": "已连接现有实例"
					},
					"Key": "Launcher.Existing"
				},
				{
					"Source": {
						"Text": "CONNECTING"
					},
					"Translation": {
						"Text": "连接中"
					},
					"Key": "Status.CONNECTING"
				},
				{
					"Source": {
						"Text": "COPY AS DRAFT"
					},
					"Translation": {
						"Text": "复制为草稿"
					},
					"Key": "Plan.Copy"
				},
				{
					"Source": {
						"Text": "CRITICAL"
					},
					"Translation": {
						"Text": "严重"
					},
					"Key": "Alarm.Critical"
				},
				{
					"Source": {
						"Text": "CRITICAL"
					},
					"Translation": {
						"Text": "严重"
					},
					"Key": "Status.CRITICAL"
				},
				{
					"Source": {
						"Text": "Camera: N/A"
					},
					"Translation": {
						"Text": "相机：暂无"
					},
					"Key": "Video.Camera"
				},
				{
					"Source": {
						"Text": "Cancel"
					},
					"Translation": {
						"Text": "取消"
					},
					"Key": "Execution.Cancel"
				},
				{
					"Source": {
						"Text": "Cannot move the plan while the mission is running."
					},
					"Translation": {
						"Text": "任务执行中，无法移动方案。"
					},
					"Key": "Errors.PLAN_EXECUTING"
				},
				{
					"Source": {
						"Text": "Cannot resolve height. Select a waypoint, enter valid values and ensure terrain is loaded."
					},
					"Translation": {
						"Text": "无法解析高度。请选择航点、输入有效数值并确保地形已加载。"
					},
					"Key": "Errors.ALTITUDE_DATUM_UNRESOLVED"
				},
				{
					"Source": {
						"Text": "Check"
					},
					"Translation": {
						"Text": "部署前检查"
					},
					"Key": "Workflow.StepCheck"
				},
				{
					"Source": {
						"Text": "Check configuration and resolve blocking issues."
					},
					"Translation": {
						"Text": "请检查配置并解决阻塞问题。"
					},
					"Key": "Errors.PLAN_NOT_READY"
				},
				{
					"Source": {
						"Text": "Check task assignment and saved route below."
					},
					"Translation": {
						"Text": "请检查以下任务分配和已保存航线。"
					},
					"Key": "Workflow.CheckInformation"
				},
				{
					"Source": {
						"Text": "Checking simulation conditions"
					},
					"Translation": {
						"Text": "正在检查模拟执行条件"
					},
					"Key": "Execution.PREFLIGHT"
				},
				{
					"Source": {
						"Text": "Click a waypoint to select it. Click the map to add one. Enter or leave a field to update."
					},
					"Translation": {
						"Text": "点击航点选择；点击地图新增航点。输入后按回车或离开字段即可更新。"
					},
					"Key": "Inspector.Help"
				},
				{
					"Source": {
						"Text": "Closed Route"
					},
					"Translation": {
						"Text": "闭合航线"
					},
					"Key": "Geometry.ClosedRoute"
				},
				{
					"Source": {
						"Text": "Closed route completed once"
					},
					"Translation": {
						"Text": "闭环航线单次执行完成"
					},
					"Key": "Events.ROUTE_CLOSURE_REACHED"
				},
				{
					"Source": {
						"Text": "Closed route requires at least 3 waypoints."
					},
					"Translation": {
						"Text": "闭合航线至少需要 3 个航点。"
					},
					"Key": "Errors.CLOSED_ROUTE_TOO_SHORT"
				},
				{
					"Source": {
						"Text": "Closed route: {0} | Execution: once | Speed: {1} | Wait: {2}"
					},
					"Translation": {
						"Text": "闭合航线：{0} | 单次执行 | 速度：{1} | 等待：{2}"
					},
					"Key": "Plan.RouteParameters"
				},
				{
					"Source": {
						"Text": "Configuration check only. Terrain, airspace, endurance and flight safety are not assessed."
					},
					"Translation": {
						"Text": "仅检查业务配置，未评估地形、空域、续航和飞行安全。"
					},
					"Key": "Plan.Warnings"
				},
				{
					"Source": {
						"Text": "Configuration is deployed. The UAV has not started executing."
					},
					"Translation": {
						"Text": "配置已经部署到系统，无人机尚未开始执行。"
					},
					"Key": "Workflow.DeploymentNotice"
				},
				{
					"Source": {
						"Text": "Configuration validation is stale."
					},
					"Translation": {
						"Text": "配置检查已失效。"
					},
					"Key": "Errors.VALIDATION_STALE"
				},
				{
					"Source": {
						"Text": "Confirm"
					},
					"Translation": {
						"Text": "确认"
					},
					"Key": "Execution.Confirm"
				},
				{
					"Source": {
						"Text": "Confirm Abort"
					},
					"Translation": {
						"Text": "确认终止"
					},
					"Key": "Execution.ConfirmAbort"
				},
				{
					"Source": {
						"Text": "Confirm Position"
					},
					"Translation": {
						"Text": "确认位置"
					},
					"Key": "Geometry.Confirm"
				},
				{
					"Source": {
						"Text": "Confirm Return"
					},
					"Translation": {
						"Text": "确认返航"
					},
					"Key": "Execution.ConfirmReturn"
				},
				{
					"Source": {
						"Text": "Confirm Return Home? Remaining waypoints will be skipped and the real UAV will be commanded to its calibrated Home."
					},
					"Translation": {
						"Text": "确认返航？后续航点将跳过，真实无人机将收到前往已标定返航点的指令。"
					},
					"Key": "Execution.Real.returnConfirm"
				},
				{
					"Source": {
						"Text": "Confirm Return Home? Remaining waypoints will be skipped. The Mock UAV will return to its defined Home."
					},
					"Translation": {
						"Text": "确认返航？当前任务将停止执行后续航点，Mock UAV 将返回预设的模拟 Home 点。"
					},
					"Key": "Execution.returnConfirm"
				},
				{
					"Source": {
						"Text": "Confirm Start Mission"
					},
					"Translation": {
						"Text": "确认开始任务"
					},
					"Key": "Execution.ConfirmStart"
				},
				{
					"Source": {
						"Text": "Confirm abort? The mission cannot resume. Backend requests a hold at the measured position and reports any rejection."
					},
					"Translation": {
						"Text": "确认终止？该任务无法恢复。后端请求在实测位置保持，并报告任何拒绝结果。"
					},
					"Key": "Execution.Real.abortConfirm"
				},
				{
					"Source": {
						"Text": "Confirm abort? This execution cannot be resumed. The Mock UAV will stop at its current position."
					},
					"Translation": {
						"Text": "确认终止任务？本次执行无法继续，Mock UAV 将停在当前位置。"
					},
					"Key": "Execution.abortConfirm"
				},
				{
					"Source": {
						"Text": "Confirm and deploy →"
					},
					"Translation": {
						"Text": "确认并部署 →"
					},
					"Key": "Workflow.ConfirmDeploy"
				},
				{
					"Source": {
						"Text": "Confirm delete draft"
					},
					"Translation": {
						"Text": "确认删除草稿"
					},
					"Key": "Workflow.DeleteDraft"
				},
				{
					"Source": {
						"Text": "Confirm mission execution"
					},
					"Translation": {
						"Text": "任务执行确认"
					},
					"Key": "Execution.StartConfirm"
				},
				{
					"Source": {
						"Text": "Continue editing"
					},
					"Translation": {
						"Text": "继续编辑"
					},
					"Key": "Workflow.ContinueEditing"
				},
				{
					"Source": {
						"Text": "Create a new version from this plan"
					},
					"Translation": {
						"Text": "基于此方案创建新版本"
					},
					"Key": "Workflow.NewVersion"
				},
				{
					"Source": {
						"Text": "Create and continue"
					},
					"Translation": {
						"Text": "创建并继续"
					},
					"Key": "Workflow.CreateContinue"
				},
				{
					"Source": {
						"Text": "Create → Configure → Edit route → Check → Deploy"
					},
					"Translation": {
						"Text": "新建 → 配置 → 编辑航线 → 检查 → 部署"
					},
					"Key": "Workflow.GlobalHint"
				},
				{
					"Source": {
						"Text": "Created a new version: {plan_name}"
					},
					"Translation": {
						"Text": "已创建方案新版本：{plan_name}"
					},
					"Key": "Events.PLAN_VERSION_CREATED"
				},
				{
					"Source": {
						"Text": "Created: {0}"
					},
					"Translation": {
						"Text": "创建时间：{0}"
					},
					"Key": "Workflow.CreatedAt"
				},
				{
					"Source": {
						"Text": "Current security plan\n{0}\n{1}"
					},
					"Translation": {
						"Text": "当前安保方案\n{0}\n{1}"
					},
					"Key": "Workflow.CurrentPlan"
				},
				{
					"Source": {
						"Text": "DELETE MISSION"
					},
					"Translation": {
						"Text": "删除任务"
					},
					"Key": "Plan.Delete"
				},
				{
					"Source": {
						"Text": "DELETE WAYPOINT"
					},
					"Translation": {
						"Text": "删除航点"
					},
					"Key": "Map.Delete"
				},
				{
					"Source": {
						"Text": "DEPLOY PLAN"
					},
					"Translation": {
						"Text": "部署方案"
					},
					"Key": "Plan.Deploy"
				},
				{
					"Source": {
						"Text": "DIRTY / UNSAVED"
					},
					"Translation": {
						"Text": "已修改 / 未保存"
					},
					"Key": "Map.DIRTY"
				},
				{
					"Source": {
						"Text": "DISCARD CHANGES"
					},
					"Translation": {
						"Text": "放弃更改"
					},
					"Key": "Common.Discard"
				},
				{
					"Source": {
						"Text": "DISCONNECTED"
					},
					"Translation": {
						"Text": "已断开"
					},
					"Key": "Common.Disconnected"
				},
				{
					"Source": {
						"Text": "DRAFT"
					},
					"Translation": {
						"Text": "草稿"
					},
					"Key": "Plan.DRAFT"
				},
				{
					"Source": {
						"Text": "DRONE SECURITY COMMAND SYSTEM"
					},
					"Translation": {
						"Text": "无人机安防指挥系统"
					},
					"Key": "Stage1.Name"
				},
				{
					"Source": {
						"Text": "Declare the real anchor altitude datum before execution."
					},
					"Translation": {
						"Text": "执行前须明确真实锚点的高度基准。"
					},
					"Key": "Errors.REAL_ANCHOR_DATUM_UNRESOLVED"
				},
				{
					"Source": {
						"Text": "Deploy"
					},
					"Translation": {
						"Text": "部署"
					},
					"Key": "Workflow.StepDeploy"
				},
				{
					"Source": {
						"Text": "Deploy Plan →"
					},
					"Translation": {
						"Text": "部署方案 →"
					},
					"Key": "Execution.Deploy"
				},
				{
					"Source": {
						"Text": "Deployed"
					},
					"Translation": {
						"Text": "已部署"
					},
					"Key": "Plan.DEPLOYED"
				},
				{
					"Source": {
						"Text": "Deployed"
					},
					"Translation": {
						"Text": "已部署"
					},
					"Key": "Workflow.Deployed"
				},
				{
					"Source": {
						"Text": "Deployed plan is read only."
					},
					"Translation": {
						"Text": "已部署方案为只读。"
					},
					"Key": "Errors.PLAN_DEPLOYED"
				},
				{
					"Source": {
						"Text": "Deployed route is read-only"
					},
					"Translation": {
						"Text": "当前部署航线为只读状态"
					},
					"Key": "Execution.ReadOnly"
				},
				{
					"Source": {
						"Text": "Deployment created: {plan_name}"
					},
					"Translation": {
						"Text": "已创建部署：{plan_name}"
					},
					"Key": "Events.DEPLOYMENT_CREATED"
				},
				{
					"Source": {
						"Text": "Deployment record"
					},
					"Translation": {
						"Text": "部署记录"
					},
					"Key": "Plan.Deployment"
				},
				{
					"Source": {
						"Text": "Deployment snapshot is missing."
					},
					"Translation": {
						"Text": "部署快照缺失。"
					},
					"Key": "Errors.DEPLOYMENT_MISSING"
				},
				{
					"Source": {
						"Text": "Description"
					},
					"Translation": {
						"Text": "描述"
					},
					"Key": "Plan.Description"
				},
				{
					"Source": {
						"Text": "Discard local changes and reload the saved route?"
					},
					"Translation": {
						"Text": "放弃本地修改并重新载入已保存航线？"
					},
					"Key": "Map.DiscardPrompt"
				},
				{
					"Source": {
						"Text": "Disconnected"
					},
					"Translation": {
						"Text": "失联"
					},
					"Key": "Fleet.Lost"
				},
				{
					"Source": {
						"Text": "Distance: {0} m · Estimated: {1} min (minimum estimate speed 1 m/s)"
					},
					"Translation": {
						"Text": "距离：{0} 米 · 预计：{1} 分钟（估算最低速度 1 米/秒）"
					},
					"Key": "Workflow.RouteStats"
				},
				{
					"Source": {
						"Text": "Draft deleted: {plan_name}"
					},
					"Translation": {
						"Text": "已删除草稿：{plan_name}"
					},
					"Key": "Events.PLAN_DELETED"
				},
				{
					"Source": {
						"Text": "Drag the center handle to move all routes."
					},
					"Translation": {
						"Text": "拖动中心手柄，整体移动方案内所有航线。"
					},
					"Key": "Geometry.Drag"
				},
				{
					"Source": {
						"Text": "Duplicate"
					},
					"Translation": {
						"Text": "复制"
					},
					"Key": "Workflow.Duplicate"
				},
				{
					"Source": {
						"Text": "EDIT ROUTE ON MAP"
					},
					"Translation": {
						"Text": "在地图编辑航线"
					},
					"Key": "Plan.EditMap"
				},
				{
					"Source": {
						"Text": "EDITING"
					},
					"Translation": {
						"Text": "编辑中"
					},
					"Key": "Map.EDITING"
				},
				{
					"Source": {
						"Text": "EVENT / OPERATION LOG (UTC) | Critical {0} | Warning {1}"
					},
					"Translation": {
						"Text": "事件 / 操作日志（UTC）| 严重 {0} | 警告 {1}"
					},
					"Key": "Log.Count"
				},
				{
					"Source": {
						"Text": "EXIT"
					},
					"Translation": {
						"Text": "退出"
					},
					"Key": "Common.Exit"
				},
				{
					"Source": {
						"Text": "EXPAND"
					},
					"Translation": {
						"Text": "展开"
					},
					"Key": "Common.Expand"
				},
				{
					"Source": {
						"Text": "Edit Route in Map →"
					},
					"Translation": {
						"Text": "前往地图编辑航线 →"
					},
					"Key": "Workflow.EditMap"
				},
				{
					"Source": {
						"Text": "Edit and save a route on Map."
					},
					"Translation": {
						"Text": "请在地图编辑并保存航线。"
					},
					"Key": "Errors.ROUTE_MISSING"
				},
				{
					"Source": {
						"Text": "Edit speed"
					},
					"Translation": {
						"Text": "编辑速度"
					},
					"Key": "Workflow.EditSpeed"
				},
				{
					"Source": {
						"Text": "Editing in Map\n{0}\n{1} · {2}\nSaved waypoints: {3}"
					},
					"Translation": {
						"Text": "正在 Map 中编辑\n{0}\n{1} · {2}\n已保存航点：{3}"
					},
					"Key": "Workflow.MapEditingStatus"
				},
				{
					"Source": {
						"Text": "Editing lease expired. Local draft retained; discard and reload."
					},
					"Translation": {
						"Text": "编辑租约已过期，本地草稿保留，请放弃并重新载入。"
					},
					"Key": "Errors.EDIT_SESSION_EXPIRED"
				},
				{
					"Source": {
						"Text": "English"
					},
					"Translation": {
						"Text": "English"
					},
					"Key": "Workflow.English"
				},
				{
					"Source": {
						"Text": "Enter a valid future local date and time."
					},
					"Translation": {
						"Text": "请输入有效的未来本地日期与时间。"
					},
					"Key": "Errors.INVALID_SCHEDULE"
				},
				{
					"Source": {
						"Text": "Enter a valid name."
					},
					"Translation": {
						"Text": "请输入有效名称。"
					},
					"Key": "Errors.INVALID_NAME"
				},
				{
					"Source": {
						"Text": "Enter finite values: hover >= 0; speed 0 to 15 m/s."
					},
					"Translation": {
						"Text": "请输入有效数值：悬停时间 ≥ 0，速度 0 至 15 m/s。"
					},
					"Key": "Errors.WAYPOINT_PARAMETERS_INVALID"
				},
				{
					"Source": {
						"Text": "Entered alert response"
					},
					"Translation": {
						"Text": "已进入告警处置"
					},
					"Key": "Events.enter_alert_response"
				},
				{
					"Source": {
						"Text": "Estimated distance: {0} m · Time: {1} seconds"
					},
					"Translation": {
						"Text": "预计距离：{0} 米 · 时间：{1} 秒"
					},
					"Key": "Execution.Estimate"
				},
				{
					"Source": {
						"Text": "Execution Monitor"
					},
					"Translation": {
						"Text": "任务执行监控"
					},
					"Key": "Execution.MonitorNeutral"
				},
				{
					"Source": {
						"Text": "Execution Monitor · SIMULATION"
					},
					"Translation": {
						"Text": "任务监控 · 模拟执行"
					},
					"Key": "Execution.Monitor"
				},
				{
					"Source": {
						"Text": "Execution history / View plan"
					},
					"Translation": {
						"Text": "执行记录 / 查看方案"
					},
					"Key": "Execution.History"
				},
				{
					"Source": {
						"Text": "Execution no longer exists."
					},
					"Translation": {
						"Text": "未找到本次任务执行。"
					},
					"Key": "Errors.EXECUTION_NOT_FOUND"
				},
				{
					"Source": {
						"Text": "Execution request identifier is required."
					},
					"Translation": {
						"Text": "缺少任务操作请求标识。"
					},
					"Key": "Errors.REQUEST_ID_REQUIRED"
				},
				{
					"Source": {
						"Text": "Execution time: {0} seconds"
					},
					"Translation": {
						"Text": "执行时间：{0} 秒"
					},
					"Key": "Execution.Duration"
				},
				{
					"Source": {
						"Text": "FAILED"
					},
					"Translation": {
						"Text": "失败"
					},
					"Key": "Launcher.FAILED"
				},
				{
					"Source": {
						"Text": "FOCUS"
					},
					"Translation": {
						"Text": "聚焦布局"
					},
					"Key": "Video.Focus"
				},
				{
					"Source": {
						"Text": "FOCUS ROUTE"
					},
					"Translation": {
						"Text": "定位航线"
					},
					"Key": "Map.Focus"
				},
				{
					"Source": {
						"Text": "Finish route editing"
					},
					"Translation": {
						"Text": "完成航线编辑"
					},
					"Key": "Workflow.FinishRoute"
				},
				{
					"Source": {
						"Text": "Finish route editing before switching map mode."
					},
					"Translation": {
						"Text": "请先完成航线编辑后切换地图模式"
					},
					"Key": "Map.FinishBeforeMode"
				},
				{
					"Source": {
						"Text": "Focus"
					},
					"Translation": {
						"Text": "聚焦"
					},
					"Key": "Launcher.Focus"
				},
				{
					"Source": {
						"Text": "Formation requires a nonpolar area within 10 km."
					},
					"Translation": {
						"Text": "编队需要处于 10 公里内的非极地区域。"
					},
					"Key": "Errors.TRAJECTORY_DOMAIN_UNSUPPORTED"
				},
				{
					"Source": {
						"Text": "Fresh valid aircraft telemetry is unavailable."
					},
					"Translation": {
						"Text": "缺少新鲜有效的无人机遥测。"
					},
					"Key": "Errors.REAL_TELEMETRY_UNAVAILABLE"
				},
				{
					"Source": {
						"Text": "GROUP CONTROL"
					},
					"Translation": {
						"Text": "无人机组控制"
					},
					"Key": "Group.Title"
				},
				{
					"Source": {
						"Text": "Group anchor ellipsoid altitude (m)"
					},
					"Translation": {
						"Text": "编组目标椭球高（米）"
					},
					"Key": "Group.Altitude"
				},
				{
					"Source": {
						"Text": "Group anchor latitude (WGS84)"
					},
					"Translation": {
						"Text": "编组目标纬度（WGS84）"
					},
					"Key": "Group.Latitude"
				},
				{
					"Source": {
						"Text": "Group anchor longitude (WGS84)"
					},
					"Translation": {
						"Text": "编组目标经度（WGS84）"
					},
					"Key": "Group.Longitude"
				},
				{
					"Source": {
						"Text": "Group command accepted by Backend"
					},
					"Translation": {
						"Text": "后端已接受编组指令"
					},
					"Key": "Group.Accepted"
				},
				{
					"Source": {
						"Text": "Handled"
					},
					"Translation": {
						"Text": "已处理"
					},
					"Key": "Alarm.Handled"
				},
				{
					"Source": {
						"Text": "Hold was not confirmed. Check the aircraft and control link immediately."
					},
					"Translation": {
						"Text": "保持位置请求未确认，请立即检查无人机和控制链路。"
					},
					"Key": "Errors.REAL_HOLD_REJECTED"
				},
				{
					"Source": {
						"Text": "Hover time (seconds)"
					},
					"Translation": {
						"Text": "悬停时间（秒）"
					},
					"Key": "Mission3D.Hover"
				},
				{
					"Source": {
						"Text": "INFO"
					},
					"Translation": {
						"Text": "信息"
					},
					"Key": "Alarm.Info"
				},
				{
					"Source": {
						"Text": "INFO"
					},
					"Translation": {
						"Text": "信息"
					},
					"Key": "Status.INFO"
				},
				{
					"Source": {
						"Text": "Idle"
					},
					"Translation": {
						"Text": "待命"
					},
					"Key": "Fleet.Idle"
				},
				{
					"Source": {
						"Text": "Immutable deployment and saved route"
					},
					"Translation": {
						"Text": "部署有效，航线版本已固定"
					},
					"Key": "Execution.DeploymentValid"
				},
				{
					"Source": {
						"Text": "Info"
					},
					"Translation": {
						"Text": "基本信息"
					},
					"Key": "Workflow.StepInfo"
				},
				{
					"Source": {
						"Text": "LINK N/A | MISSION N/A"
					},
					"Translation": {
						"Text": "连接 暂无 | 任务 暂无"
					},
					"Key": "Command.NoMission"
				},
				{
					"Source": {
						"Text": "LINK {0}\nMISSION {1}"
					},
					"Translation": {
						"Text": "连接 {0}\n任务 {1}"
					},
					"Key": "Command.Link"
				},
				{
					"Source": {
						"Text": "LIVE CONTROL · Real UAV"
					},
					"Translation": {
						"Text": "真实控制 · 无人机"
					},
					"Key": "Execution.Real"
				},
				{
					"Source": {
						"Text": "LOCATE"
					},
					"Translation": {
						"Text": "定位"
					},
					"Key": "Map.Locate"
				},
				{
					"Source": {
						"Text": "LOST"
					},
					"Translation": {
						"Text": "失联"
					},
					"Key": "Common.Lost"
				},
				{
					"Source": {
						"Text": "Language"
					},
					"Translation": {
						"Text": "语言"
					},
					"Key": "Common.Language"
				},
				{
					"Source": {
						"Text": "Language {0}  |  {1}"
					},
					"Translation": {
						"Text": "语言 {0}  |  {1}"
					},
					"Key": "Stage1.Detail"
				},
				{
					"Source": {
						"Text": "Last saved: {0}"
					},
					"Translation": {
						"Text": "最近保存：{0}"
					},
					"Key": "Workflow.LastSaved"
				},
				{
					"Source": {
						"Text": "Launch System"
					},
					"Translation": {
						"Text": "启动系统"
					},
					"Key": "Launcher.Start"
				},
				{
					"Source": {
						"Text": "Line formation spacing (m)"
					},
					"Translation": {
						"Text": "横向编队间距（米）"
					},
					"Key": "Formation.LineSpacing"
				},
				{
					"Source": {
						"Text": "Local rehearsal: backend refresh disabled"
					},
					"Translation": {
						"Text": "纯本地预演：后端刷新已禁用"
					},
					"Key": "Fleet.Local"
				},
				{
					"Source": {
						"Text": "Local start date/time: YYYY-MM-DDTHH:MM:SS"
					},
					"Translation": {
						"Text": "本地启动日期时间：YYYY-MM-DDTHH:MM:SS"
					},
					"Key": "Schedule.LocalTime"
				},
				{
					"Source": {
						"Text": "Logs"
					},
					"Translation": {
						"Text": "日志"
					},
					"Key": "Nav.Logs"
				},
				{
					"Source": {
						"Text": "Longitude: {0}\nLatitude: {1}"
					},
					"Translation": {
						"Text": "经度：{0}\n纬度：{1}"
					},
					"Key": "Inspector.Coordinates"
				},
				{
					"Source": {
						"Text": "MAP OPERATIONS"
					},
					"Translation": {
						"Text": "地图作业"
					},
					"Key": "Map.Header"
				},
				{
					"Source": {
						"Text": "MARK HANDLED"
					},
					"Translation": {
						"Text": "标记已处理"
					},
					"Key": "Command.Handled"
				},
				{
					"Source": {
						"Text": "MEDIA ERROR"
					},
					"Translation": {
						"Text": "媒体错误"
					},
					"Key": "Status.MEDIA_ERROR"
				},
				{
					"Source": {
						"Text": "MISSION"
					},
					"Translation": {
						"Text": "任务"
					},
					"Key": "Status.MISSION"
				},
				{
					"Source": {
						"Text": "MISSION ROUTE"
					},
					"Translation": {
						"Text": "任务航线"
					},
					"Key": "Map.Route"
				},
				{
					"Source": {
						"Text": "MISSIONS"
					},
					"Translation": {
						"Text": "任务列表"
					},
					"Key": "Plan.Missions"
				},
				{
					"Source": {
						"Text": "MISSION_EXECUTION"
					},
					"Translation": {
						"Text": "任务执行"
					},
					"Key": "Status.MISSION_EXECUTION"
				},
				{
					"Source": {
						"Text": "MONITOR"
					},
					"Translation": {
						"Text": "监控"
					},
					"Key": "Status.MONITOR"
				},
				{
					"Source": {
						"Text": "MOVE GROUP"
					},
					"Translation": {
						"Text": "编组移动"
					},
					"Key": "Group.Move"
				},
				{
					"Source": {
						"Text": "MULTI SELECTED"
					},
					"Translation": {
						"Text": "多选中"
					},
					"Key": "Fleet.Multi"
				},
				{
					"Source": {
						"Text": "Map client offline\nYour saved draft is retained.\n{0}\n{1} · {2}\nSaved waypoints: {3}"
					},
					"Translation": {
						"Text": "Map 客户端离线\n已保存的方案草稿不会丢失。\n{0}\n{1} · {2}\n已保存航点：{3}"
					},
					"Key": "Workflow.MapOfflineStatus"
				},
				{
					"Source": {
						"Text": "Map client unavailable"
					},
					"Translation": {
						"Text": "地图客户端未连接"
					},
					"Key": "Errors.MAP_CLIENT_UNAVAILABLE"
				},
				{
					"Source": {
						"Text": "Map coordinates are not ready. Retry when the map is loaded."
					},
					"Translation": {
						"Text": "地图坐标服务尚未就绪，请在地图加载后重试。"
					},
					"Key": "Errors.COORDINATES_NOT_READY"
				},
				{
					"Source": {
						"Text": "Map initializing"
					},
					"Translation": {
						"Text": "地图初始化中"
					},
					"Key": "Map.Init"
				},
				{
					"Source": {
						"Text": "Map route editing is in progress. Save or discard before review or deployment."
					},
					"Translation": {
						"Text": "地图航线正在编辑，请先保存或放弃，再审阅或部署。"
					},
					"Key": "Errors.PLAN_EDIT_IN_PROGRESS"
				},
				{
					"Source": {
						"Text": "Measured NED position is invalid."
					},
					"Translation": {
						"Text": "实测 NED 位置无效。"
					},
					"Key": "Errors.REAL_NED_INVALID"
				},
				{
					"Source": {
						"Text": "Measured UAV position left the hover tolerance."
					},
					"Translation": {
						"Text": "实测无人机位置超出悬停容差。"
					},
					"Key": "Errors.REAL_HOVER_DRIFT"
				},
				{
					"Source": {
						"Text": "Mission aborted"
					},
					"Translation": {
						"Text": "任务已终止"
					},
					"Key": "Execution.ABORTED"
				},
				{
					"Source": {
						"Text": "Mission aborted · {uav_id}"
					},
					"Translation": {
						"Text": "任务已终止 · {uav_id}"
					},
					"Key": "Events.MISSION_ABORTED"
				},
				{
					"Source": {
						"Text": "Mission completed"
					},
					"Translation": {
						"Text": "任务已完成"
					},
					"Key": "Execution.COMPLETED"
				},
				{
					"Source": {
						"Text": "Mission completed · {uav_id}"
					},
					"Translation": {
						"Text": "任务已完成 · {uav_id}"
					},
					"Key": "Events.MISSION_COMPLETED"
				},
				{
					"Source": {
						"Text": "Mission created"
					},
					"Translation": {
						"Text": "任务已创建"
					},
					"Key": "Execution.CREATED"
				},
				{
					"Source": {
						"Text": "Mission executing"
					},
					"Translation": {
						"Text": "任务执行中"
					},
					"Key": "Execution.EXECUTING"
				},
				{
					"Source": {
						"Text": "Mission execution created · {uav_id}"
					},
					"Translation": {
						"Text": "任务执行已创建 · {uav_id}"
					},
					"Key": "Events.EXECUTION_CREATED"
				},
				{
					"Source": {
						"Text": "Mission failed"
					},
					"Translation": {
						"Text": "任务失败"
					},
					"Key": "Execution.FAILED"
				},
				{
					"Source": {
						"Text": "Mission failed · {uav_id}"
					},
					"Translation": {
						"Text": "任务失败 · {uav_id}"
					},
					"Key": "Events.MISSION_FAILED"
				},
				{
					"Source": {
						"Text": "Mission paused"
					},
					"Translation": {
						"Text": "任务已暂停"
					},
					"Key": "Execution.PAUSED"
				},
				{
					"Source": {
						"Text": "Mission paused · {uav_id}"
					},
					"Translation": {
						"Text": "任务已暂停 · {uav_id}"
					},
					"Key": "Events.MISSION_PAUSED"
				},
				{
					"Source": {
						"Text": "Mission resumed · {uav_id}"
					},
					"Translation": {
						"Text": "任务已继续 · {uav_id}"
					},
					"Key": "Events.MISSION_RESUMED"
				},
				{
					"Source": {
						"Text": "Mission selected: {target}"
					},
					"Translation": {
						"Text": "已选择任务：{target}"
					},
					"Key": "Events.active_mission_id_changed"
				},
				{
					"Source": {
						"Text": "Mission started · {uav_id}"
					},
					"Translation": {
						"Text": "任务已开始 · {uav_id}"
					},
					"Key": "Events.MISSION_STARTED"
				},
				{
					"Source": {
						"Text": "Mission starting · {uav_id}"
					},
					"Translation": {
						"Text": "任务正在启动 · {uav_id}"
					},
					"Key": "Events.MISSION_STARTING"
				},
				{
					"Source": {
						"Text": "Mission state changed. Review the current state and retry."
					},
					"Translation": {
						"Text": "任务状态已变化，请确认当前状态后重试。"
					},
					"Key": "Errors.EXECUTION_STALE"
				},
				{
					"Source": {
						"Text": "Mission {mission_name} UAV unassigned"
					},
					"Translation": {
						"Text": "任务 {mission_name} 已取消无人机分配"
					},
					"Key": "Events.UAV_UNASSIGNED"
				},
				{
					"Source": {
						"Text": "Mission {mission_name} created"
					},
					"Translation": {
						"Text": "已创建任务 {mission_name}"
					},
					"Key": "Events.MISSION_CREATED"
				},
				{
					"Source": {
						"Text": "Mission {mission_name} renamed"
					},
					"Translation": {
						"Text": "已重命名任务 {mission_name}"
					},
					"Key": "Events.MISSION_UPDATED"
				},
				{
					"Source": {
						"Text": "Mission {mission_name} route cleared"
					},
					"Translation": {
						"Text": "任务 {mission_name} 航线已清空"
					},
					"Key": "Events.ROUTE_CLEARED"
				},
				{
					"Source": {
						"Text": "Mission {mission_name} route saved"
					},
					"Translation": {
						"Text": "任务 {mission_name} 航线已保存"
					},
					"Key": "Events.ROUTE_CREATED"
				},
				{
					"Source": {
						"Text": "Mission {mission_name} route updated"
					},
					"Translation": {
						"Text": "任务 {mission_name} 航线已更新"
					},
					"Key": "Events.ROUTE_UPDATED"
				},
				{
					"Source": {
						"Text": "Mission {target_id} deleted"
					},
					"Translation": {
						"Text": "已删除任务 {target_id}"
					},
					"Key": "Events.MISSION_DELETED"
				},
				{
					"Source": {
						"Text": "Mock UAV unavailable. Check the simulation fixture and registry."
					},
					"Translation": {
						"Text": "Mock UAV 不可用，请检查模拟配置与注册表。"
					},
					"Key": "Errors.MOCK_UAV_UNAVAILABLE"
				},
				{
					"Source": {
						"Text": "Model not supplied by Registry. Visual presets are not aircraft specifications."
					},
					"Translation": {
						"Text": "注册表未提供机型，外观预设不代表飞机规格。"
					},
					"Key": "Video.ModelNotice"
				},
				{
					"Source": {
						"Text": "Move Plan"
					},
					"Translation": {
						"Text": "整体移动"
					},
					"Key": "Geometry.MovePlan"
				},
				{
					"Source": {
						"Text": "Moving Security Plan: {0}"
					},
					"Translation": {
						"Text": "正在移动安保方案：{0}"
					},
					"Key": "Geometry.Moving"
				},
				{
					"Source": {
						"Text": "NEW PLAN"
					},
					"Translation": {
						"Text": "新建方案"
					},
					"Key": "Plan.New"
				},
				{
					"Source": {
						"Text": "NO ACTIVE ALERTS"
					},
					"Translation": {
						"Text": "无活动告警"
					},
					"Key": "Video.NoAlerts"
				},
				{
					"Source": {
						"Text": "NO SOURCE"
					},
					"Translation": {
						"Text": "无视频源"
					},
					"Key": "Status.NO_SOURCE"
				},
				{
					"Source": {
						"Text": "NO SOURCE\nAssign a video source to this UAV"
					},
					"Translation": {
						"Text": "无视频源\n请为此无人机配置视频源"
					},
					"Key": "Video.NoSource"
				},
				{
					"Source": {
						"Text": "NO TARGET"
					},
					"Translation": {
						"Text": "未指定目标"
					},
					"Key": "Status.NO_TARGET"
				},
				{
					"Source": {
						"Text": "NO TARGET\nNO ACTIVE STREAM"
					},
					"Translation": {
						"Text": "未指定目标\n无活动视频流"
					},
					"Key": "Video.NoTarget"
				},
				{
					"Source": {
						"Text": "NO VIDEO TARGET\nChoose View Video to open a UAV feed."
					},
					"Translation": {
						"Text": "尚未选择视频目标\n点击“查看视频”调取无人机画面。"
					},
					"Key": "Video.NoTargetHint"
				},
				{
					"Source": {
						"Text": "Next: task configuration"
					},
					"Translation": {
						"Text": "下一步：任务配置 →"
					},
					"Key": "Workflow.NextTask"
				},
				{
					"Source": {
						"Text": "No UAV selected"
					},
					"Translation": {
						"Text": "未选择无人机"
					},
					"Key": "Command.NoSelection"
				},
				{
					"Source": {
						"Text": "No active execution conflict"
					},
					"Translation": {
						"Text": "当前无任务执行冲突"
					},
					"Key": "Execution.NoConflict"
				},
				{
					"Source": {
						"Text": "No active mission"
					},
					"Translation": {
						"Text": "当前没有正在执行的任务"
					},
					"Key": "Execution.None"
				},
				{
					"Source": {
						"Text": "No active plan"
					},
					"Translation": {
						"Text": "未选择方案"
					},
					"Key": "Plan.NoPlan"
				},
				{
					"Source": {
						"Text": "No alerts in this session"
					},
					"Translation": {
						"Text": "本会话尚未收到告警"
					},
					"Key": "Command.NoAlerts"
				},
				{
					"Source": {
						"Text": "No events in this view"
					},
					"Translation": {
						"Text": "当前视图暂无事件"
					},
					"Key": "Log.Empty"
				},
				{
					"Source": {
						"Text": "No missions / Add first mission"
					},
					"Translation": {
						"Text": "暂无任务 / 添加首个任务"
					},
					"Key": "Plan.NoMissions"
				},
				{
					"Source": {
						"Text": "No valid map position"
					},
					"Translation": {
						"Text": "无法在该位置创建航点"
					},
					"Key": "Map.InvalidPosition"
				},
				{
					"Source": {
						"Text": "Not assigned"
					},
					"Translation": {
						"Text": "未分配"
					},
					"Key": "Common.None"
				},
				{
					"Source": {
						"Text": "OFFLINE"
					},
					"Translation": {
						"Text": "离线"
					},
					"Key": "Common.Offline"
				},
				{
					"Source": {
						"Text": "OFFLINE"
					},
					"Translation": {
						"Text": "离线"
					},
					"Key": "Launcher.OFFLINE"
				},
				{
					"Source": {
						"Text": "OFFLINE"
					},
					"Translation": {
						"Text": "离线"
					},
					"Key": "Stage1.Offline"
				},
				{
					"Source": {
						"Text": "OFFLINE / LOAD FAILED"
					},
					"Translation": {
						"Text": "离线 / 加载失败"
					},
					"Key": "Status.OFFLINE___LOAD_FAILED"
				},
				{
					"Source": {
						"Text": "ONLINE"
					},
					"Translation": {
						"Text": "在线"
					},
					"Key": "Common.Online"
				},
				{
					"Source": {
						"Text": "ONLINE"
					},
					"Translation": {
						"Text": "在线"
					},
					"Key": "Launcher.ONLINE"
				},
				{
					"Source": {
						"Text": "ONLINE"
					},
					"Translation": {
						"Text": "在线"
					},
					"Key": "Stage1.Online"
				},
				{
					"Source": {
						"Text": "OPEN VIDEO"
					},
					"Translation": {
						"Text": "查看视频"
					},
					"Key": "Video.Open"
				},
				{
					"Source": {
						"Text": "OPERATION"
					},
					"Translation": {
						"Text": "操作"
					},
					"Key": "Status.OPERATION"
				},
				{
					"Source": {
						"Text": "Offline"
					},
					"Translation": {
						"Text": "离线"
					},
					"Key": "Fleet.Offline"
				},
				{
					"Source": {
						"Text": "Online"
					},
					"Translation": {
						"Text": "在线"
					},
					"Key": "Fleet.Online"
				},
				{
					"Source": {
						"Text": "Only Line formation is currently available."
					},
					"Translation": {
						"Text": "当前仅支持横向编队。"
					},
					"Key": "Errors.FORMATION_UNSUPPORTED"
				},
				{
					"Source": {
						"Text": "Open mission"
					},
					"Translation": {
						"Text": "打开任务"
					},
					"Key": "Execution.Open"
				},
				{
					"Source": {
						"Text": "Open plan"
					},
					"Translation": {
						"Text": "打开方案"
					},
					"Key": "Workflow.OpenPlan"
				},
				{
					"Source": {
						"Text": "Opened {plan_name}"
					},
					"Translation": {
						"Text": "已打开方案 {plan_name}"
					},
					"Key": "Events.PLAN_OPENED"
				},
				{
					"Source": {
						"Text": "Operation failed:"
					},
					"Translation": {
						"Text": "操作失败："
					},
					"Key": "Launcher.Error"
				},
				{
					"Source": {
						"Text": "Operation mode changed: {target}"
					},
					"Translation": {
						"Text": "操作模式已切换：{target}"
					},
					"Key": "Events.operation_mode_changed"
				},
				{
					"Source": {
						"Text": "Overview"
					},
					"Translation": {
						"Text": "总览"
					},
					"Key": "Nav.Overview"
				},
				{
					"Source": {
						"Text": "PAGE READY / WAITING VIDEO"
					},
					"Translation": {
						"Text": "页面就绪 / 等待视频"
					},
					"Key": "Status.PAGE_READY___WAITING_VIDEO"
				},
				{
					"Source": {
						"Text": "PERSON\n\nVEHICLE\n\nUAV\n\nBEHAVIOR\n\nOTHER"
					},
					"Translation": {
						"Text": "人员\n\n车辆\n\n无人机\n\n异常行为\n\n其他目标"
					},
					"Key": "Video.Categories"
				},
				{
					"Source": {
						"Text": "PLAN"
					},
					"Translation": {
						"Text": "方案"
					},
					"Key": "Status.PLAN"
				},
				{
					"Source": {
						"Text": "PLAN_EDIT"
					},
					"Translation": {
						"Text": "方案编辑"
					},
					"Key": "Status.PLAN_EDIT"
				},
				{
					"Source": {
						"Text": "PLAYBACK"
					},
					"Translation": {
						"Text": "回放"
					},
					"Key": "Status.PLAYBACK"
				},
				{
					"Source": {
						"Text": "PLAYING"
					},
					"Translation": {
						"Text": "正在播放"
					},
					"Key": "Status.PLAYING"
				},
				{
					"Source": {
						"Text": "PRIMARY"
					},
					"Translation": {
						"Text": "主选中"
					},
					"Key": "Fleet.Primary"
				},
				{
					"Source": {
						"Text": "PRIMARY VIDEO"
					},
					"Translation": {
						"Text": "主视频"
					},
					"Key": "Video.Primary"
				},
				{
					"Source": {
						"Text": "PRIMARY VIDEO / {0}"
					},
					"Translation": {
						"Text": "主视频 / {0}"
					},
					"Key": "Video.Heading"
				},
				{
					"Source": {
						"Text": "Pause mission"
					},
					"Translation": {
						"Text": "暂停任务"
					},
					"Key": "Execution.Pause"
				},
				{
					"Source": {
						"Text": "Plan name"
					},
					"Translation": {
						"Text": "方案名称"
					},
					"Key": "Plan.Name"
				},
				{
					"Source": {
						"Text": "Plan position confirmed"
					},
					"Translation": {
						"Text": "方案位置已确认"
					},
					"Key": "Events.PLAN_TRANSLATED"
				},
				{
					"Source": {
						"Text": "Plan selected: {target}"
					},
					"Translation": {
						"Text": "已选择方案：{target}"
					},
					"Key": "Events.active_security_plan_id_changed"
				},
				{
					"Source": {
						"Text": "Plan {plan_name} configuration checked"
					},
					"Translation": {
						"Text": "方案 {plan_name} 配置已检查"
					},
					"Key": "Events.PLAN_VALIDATED"
				},
				{
					"Source": {
						"Text": "Plan {plan_name} copied as draft"
					},
					"Translation": {
						"Text": "已将方案 {plan_name} 复制为草稿"
					},
					"Key": "Events.PLAN_COPIED"
				},
				{
					"Source": {
						"Text": "Plan {plan_name} created"
					},
					"Translation": {
						"Text": "已创建方案 {plan_name}"
					},
					"Key": "Events.PLAN_CREATED"
				},
				{
					"Source": {
						"Text": "Plan {plan_name} deployed. Execution has not started."
					},
					"Translation": {
						"Text": "方案 {plan_name} 已部署，执行尚未启动"
					},
					"Key": "Events.PLAN_DEPLOYED"
				},
				{
					"Source": {
						"Text": "Plan {plan_name} reviewed"
					},
					"Translation": {
						"Text": "方案 {plan_name} 已审阅"
					},
					"Key": "Events.PLAN_REVIEWED"
				},
				{
					"Source": {
						"Text": "Plan {plan_name} updated"
					},
					"Translation": {
						"Text": "已更新方案 {plan_name}"
					},
					"Key": "Events.PLAN_UPDATED"
				},
				{
					"Source": {
						"Text": "Pre-deployment check"
					},
					"Translation": {
						"Text": "部署前检查"
					},
					"Key": "Workflow.PreDeployReview"
				},
				{
					"Source": {
						"Text": "Pre-deployment check ready: {plan_name}"
					},
					"Translation": {
						"Text": "方案可进行部署前检查：{plan_name}"
					},
					"Key": "Events.PLAN_REVIEW_READY"
				},
				{
					"Source": {
						"Text": "Preview only — confirm position to save."
					},
					"Translation": {
						"Text": "当前位置为预览，确认位置后保存。"
					},
					"Key": "Geometry.Preview"
				},
				{
					"Source": {
						"Text": "P{0} | {1} m {2} | Hover {3} s"
					},
					"Translation": {
						"Text": "P{0} | {1} 米 {2} | 悬停 {3} 秒"
					},
					"Key": "Mission3D.Marker"
				},
				{
					"Source": {
						"Text": "RECENT ALERTS"
					},
					"Translation": {
						"Text": "最近告警"
					},
					"Key": "Video.RecentAlerts"
				},
				{
					"Source": {
						"Text": "RECONNECTING"
					},
					"Translation": {
						"Text": "重连中"
					},
					"Key": "Common.Reconnecting"
				},
				{
					"Source": {
						"Text": "RECONNECTING"
					},
					"Translation": {
						"Text": "正在重连"
					},
					"Key": "Launcher.RECONNECTING"
				},
				{
					"Source": {
						"Text": "RECORD"
					},
					"Translation": {
						"Text": "录像"
					},
					"Key": "Status.RECORD"
				},
				{
					"Source": {
						"Text": "REMOVE RECORD"
					},
					"Translation": {
						"Text": "移除记录"
					},
					"Key": "Command.Remove"
				},
				{
					"Source": {
						"Text": "RENAME"
					},
					"Translation": {
						"Text": "重命名"
					},
					"Key": "Common.Rename"
				},
				{
					"Source": {
						"Text": "RENAME TASK"
					},
					"Translation": {
						"Text": "重命名任务"
					},
					"Key": "Plan.Rename"
				},
				{
					"Source": {
						"Text": "REQUEST PAUSE"
					},
					"Translation": {
						"Text": "暂停请求"
					},
					"Key": "Command.Pause"
				},
				{
					"Source": {
						"Text": "REQUEST RESUME"
					},
					"Translation": {
						"Text": "恢复请求"
					},
					"Key": "Command.Resume"
				},
				{
					"Source": {
						"Text": "RESCHEDULE"
					},
					"Translation": {
						"Text": "修改启动时间"
					},
					"Key": "Schedule.Reschedule"
				},
				{
					"Source": {
						"Text": "RESERVED"
					},
					"Translation": {
						"Text": "预留"
					},
					"Key": "Status.RESERVED"
				},
				{
					"Source": {
						"Text": "RESERVED\nNO UAV ASSIGNED"
					},
					"Translation": {
						"Text": "预留格位\n未分配无人机"
					},
					"Key": "Video.Reserved"
				},
				{
					"Source": {
						"Text": "RETRY"
					},
					"Translation": {
						"Text": "重试"
					},
					"Key": "Video.Retry"
				},
				{
					"Source": {
						"Text": "RETRYING"
					},
					"Translation": {
						"Text": "重试中"
					},
					"Key": "Status.RETRYING"
				},
				{
					"Source": {
						"Text": "REVIEW PLAN"
					},
					"Translation": {
						"Text": "审阅方案"
					},
					"Key": "Plan.Review"
				},
				{
					"Source": {
						"Text": "ROUTE EDITING | MAP VIEW LOCKED"
					},
					"Translation": {
						"Text": "航线编辑中 | 地图视角已锁定"
					},
					"Key": "Map.ViewLocked"
				},
				{
					"Source": {
						"Text": "Real UAV or its calibrated frame is unavailable."
					},
					"Translation": {
						"Text": "真实无人机或其标定坐标框架不可用。"
					},
					"Key": "Errors.REAL_UAV_UNAVAILABLE"
				},
				{
					"Source": {
						"Text": "Real UAV rejected the command. Verify Armed/Offboard and telemetry."
					},
					"Translation": {
						"Text": "真实无人机拒绝指令，请检查 Armed/Offboard 与遥测。"
					},
					"Key": "Errors.REAL_COMMAND_REJECTED"
				},
				{
					"Source": {
						"Text": "Real adapter configuration is incomplete or invalid."
					},
					"Translation": {
						"Text": "真实适配器配置缺失或无效。"
					},
					"Key": "Errors.REAL_CONFIGURATION_INVALID"
				},
				{
					"Source": {
						"Text": "Real adapter configured; Backend checks live readiness"
					},
					"Translation": {
						"Text": "已配置真实接口；后端检查实时就绪状态"
					},
					"Key": "Execution.RealAvailable"
				},
				{
					"Source": {
						"Text": "Real control requires fresh measured telemetry, calibrated coordinates and Armed/Offboard before movement. Start does not arm or take off."
					},
					"Translation": {
						"Text": "真实控制要求新鲜实测遥测、已标定坐标及 Armed/Offboard 状态。开始任务不会自动解锁或起飞。"
					},
					"Key": "Execution.RealCheck"
				},
				{
					"Source": {
						"Text": "Real execution estimates are calculated from live position by Backend at start."
					},
					"Translation": {
						"Text": "真实任务距离与预计耗时由后端在开始时根据实测位置计算。"
					},
					"Key": "Execution.RealEstimate"
				},
				{
					"Source": {
						"Text": "Real mission restored paused; verify the aircraft before resuming."
					},
					"Translation": {
						"Text": "真实任务已按暂停状态恢复，继续前请核实无人机状态。"
					},
					"Key": "Errors.REAL_RESTART_REQUIRES_RESUME"
				},
				{
					"Source": {
						"Text": "Recent events"
					},
					"Translation": {
						"Text": "最近事件"
					},
					"Key": "Workflow.RecentEvents"
				},
				{
					"Source": {
						"Text": "Request failed. Confirm the current selection and retry."
					},
					"Translation": {
						"Text": "请求失败，请确认当前选择后重试。"
					},
					"Key": "Errors.Request"
				},
				{
					"Source": {
						"Text": "Request identifier conflict."
					},
					"Translation": {
						"Text": "请求标识冲突。"
					},
					"Key": "Errors.REQUEST_ID_REUSED"
				},
				{
					"Source": {
						"Text": "Request results require Backend confirmation. Use Map for route editing."
					},
					"Translation": {
						"Text": "请求结果以后端确认为准，航线编辑请使用地图客户端。"
					},
					"Key": "Command.ActionNotice"
				},
				{
					"Source": {
						"Text": "Reserved fields\nTitle · UAV · Target\nTimestamp · Severity"
					},
					"Translation": {
						"Text": "预留字段\n标题 · 无人机 · 目标\n时间 · 严重程度"
					},
					"Key": "Video.ReservedFields"
				},
				{
					"Source": {
						"Text": "Reserved for future integration"
					},
					"Translation": {
						"Text": "预留，等待后续接入"
					},
					"Key": "Common.Reserved"
				},
				{
					"Source": {
						"Text": "Restart"
					},
					"Translation": {
						"Text": "重启"
					},
					"Key": "Launcher.Restart"
				},
				{
					"Source": {
						"Text": "Resume mission"
					},
					"Translation": {
						"Text": "继续任务"
					},
					"Key": "Execution.Resume"
				},
				{
					"Source": {
						"Text": "Return Home"
					},
					"Translation": {
						"Text": "返航"
					},
					"Key": "Execution.Return"
				},
				{
					"Source": {
						"Text": "Return to task configuration"
					},
					"Translation": {
						"Text": "返回任务配置"
					},
					"Key": "Workflow.BackEdit"
				},
				{
					"Source": {
						"Text": "Returned to simulation Home"
					},
					"Translation": {
						"Text": "已返回模拟 Home 点"
					},
					"Key": "Execution.RETURNED_HOME"
				},
				{
					"Source": {
						"Text": "Returning Home"
					},
					"Translation": {
						"Text": "正在返航"
					},
					"Key": "Execution.RETURNING"
				},
				{
					"Source": {
						"Text": "Returning Home · {uav_id}"
					},
					"Translation": {
						"Text": "任务正在返航 · {uav_id}"
					},
					"Key": "Events.MISSION_RETURNING"
				},
				{
					"Source": {
						"Text": "Review is stale. Review the current revision again."
					},
					"Translation": {
						"Text": "审阅已失效，请重新审阅当前版本。"
					},
					"Key": "Errors.REVIEW_STALE"
				},
				{
					"Source": {
						"Text": "Review the current configuration first."
					},
					"Translation": {
						"Text": "请先审阅当前配置。"
					},
					"Key": "Errors.PLAN_REVIEW_REQUIRED"
				},
				{
					"Source": {
						"Text": "Reviewed revision {0}"
					},
					"Translation": {
						"Text": "已审阅当前版本 {0}"
					},
					"Key": "Plan.Reviewed"
				},
				{
					"Source": {
						"Text": "Revision {0}"
					},
					"Translation": {
						"Text": "内容版本 {0}"
					},
					"Key": "Plan.Revision"
				},
				{
					"Source": {
						"Text": "Route"
					},
					"Translation": {
						"Text": "航线"
					},
					"Key": "Workflow.StepRoute"
				},
				{
					"Source": {
						"Text": "Route distance: {0} m"
					},
					"Translation": {
						"Text": "航线距离：{0} 米"
					},
					"Key": "Workflow.ReviewDistance"
				},
				{
					"Source": {
						"Text": "Route draft saved: {mission_name}"
					},
					"Translation": {
						"Text": "航线草稿已保存：{mission_name}"
					},
					"Key": "Events.ROUTE_SAVED"
				},
				{
					"Source": {
						"Text": "Route editing"
					},
					"Translation": {
						"Text": "航线编辑"
					},
					"Key": "Workflow.RouteEditing"
				},
				{
					"Source": {
						"Text": "Route editing completed: {mission_name}"
					},
					"Translation": {
						"Text": "航线编辑已完成：{mission_name}"
					},
					"Key": "Events.ROUTE_EDIT_COMPLETED"
				},
				{
					"Source": {
						"Text": "Route editing in progress: {0}. Review and deployment are blocked."
					},
					"Translation": {
						"Text": "航线正在编辑：{0}。暂不可审阅或部署。"
					},
					"Key": "Plan.EditingBlock"
				},
				{
					"Source": {
						"Text": "Route editing started: {mission_name}"
					},
					"Translation": {
						"Text": "开始编辑航线：{mission_name}"
					},
					"Key": "Events.ROUTE_EDIT_STARTED"
				},
				{
					"Source": {
						"Text": "Route requires at least 2 waypoints."
					},
					"Translation": {
						"Text": "航线至少需要 2 个航点。"
					},
					"Key": "Errors.ROUTE_TOO_SHORT"
				},
				{
					"Source": {
						"Text": "SAVE"
					},
					"Translation": {
						"Text": "保存"
					},
					"Key": "Common.Save"
				},
				{
					"Source": {
						"Text": "SAVE ASSIGNED UAVS"
					},
					"Translation": {
						"Text": "保存无人机分配"
					},
					"Key": "Formation.SaveAssignment"
				},
				{
					"Source": {
						"Text": "SAVE PLAN INFORMATION"
					},
					"Translation": {
						"Text": "保存方案信息"
					},
					"Key": "Plan.Update"
				},
				{
					"Source": {
						"Text": "SAVED / READ ONLY"
					},
					"Translation": {
						"Text": "已保存 / 只读"
					},
					"Key": "Map.CLEAN"
				},
				{
					"Source": {
						"Text": "SAVING"
					},
					"Translation": {
						"Text": "保存中"
					},
					"Key": "Map.SAVING"
				},
				{
					"Source": {
						"Text": "SCHEDULED"
					},
					"Translation": {
						"Text": "等待定时启动"
					},
					"Key": "Execution.SCHEDULED"
				},
				{
					"Source": {
						"Text": "SCREENSHOT"
					},
					"Translation": {
						"Text": "截图"
					},
					"Key": "Status.SCREENSHOT"
				},
				{
					"Source": {
						"Text": "SECURITY COMMAND CENTER"
					},
					"Translation": {
						"Text": "安防指挥中心"
					},
					"Key": "Command.Title"
				},
				{
					"Source": {
						"Text": "SECURITY PLAN"
					},
					"Translation": {
						"Text": "安保方案"
					},
					"Key": "Plan.Title"
				},
				{
					"Source": {
						"Text": "SELECT"
					},
					"Translation": {
						"Text": "选择"
					},
					"Key": "Common.Select"
				},
				{
					"Source": {
						"Text": "SELECT UAV"
					},
					"Translation": {
						"Text": "选择无人机"
					},
					"Key": "Command.Select"
				},
				{
					"Source": {
						"Text": "SELECT VIDEO TARGET"
					},
					"Translation": {
						"Text": "选择视频目标"
					},
					"Key": "Video.SelectFeed"
				},
				{
					"Source": {
						"Text": "SELECTED"
					},
					"Translation": {
						"Text": "已选择"
					},
					"Key": "Common.Selected"
				},
				{
					"Source": {
						"Text": "SET AS ACTIVE UAV"
					},
					"Translation": {
						"Text": "设为当前无人机"
					},
					"Key": "Video.SetActive"
				},
				{
					"Source": {
						"Text": "SIMULATION · Mock UAV"
					},
					"Translation": {
						"Text": "模拟执行 · Mock UAV"
					},
					"Key": "Execution.Simulation"
				},
				{
					"Source": {
						"Text": "SINGLE ACTIVE PLAYER · Secondary feeds are reserved slots · No AI backend connected"
					},
					"Translation": {
						"Text": "单个活动播放器 · 其他视频格位为预留 · 未连接 AI 后端"
					},
					"Key": "Video.Single"
				},
				{
					"Source": {
						"Text": "SINGLE-SCREEN MULTI-WINDOW  |  Focus a window for detailed work"
					},
					"Translation": {
						"Text": "单屏多窗口  |  聚焦窗口进行详细操作"
					},
					"Key": "Launcher.Layout"
				},
				{
					"Source": {
						"Text": "SOURCE SET"
					},
					"Translation": {
						"Text": "已配置视频源"
					},
					"Key": "Status.SOURCE_SET"
				},
				{
					"Source": {
						"Text": "STALLED / NO FRAMES"
					},
					"Translation": {
						"Text": "视频停滞 / 无新帧"
					},
					"Key": "Status.STALLED___NO_FRAMES"
				},
				{
					"Source": {
						"Text": "START NOW"
					},
					"Translation": {
						"Text": "立即启动"
					},
					"Key": "Schedule.StartNow"
				},
				{
					"Source": {
						"Text": "STARTING"
					},
					"Translation": {
						"Text": "正在启动"
					},
					"Key": "Launcher.STARTING"
				},
				{
					"Source": {
						"Text": "STOPPED"
					},
					"Translation": {
						"Text": "已停止"
					},
					"Key": "Launcher.STOPPED"
				},
				{
					"Source": {
						"Text": "STOPPING"
					},
					"Translation": {
						"Text": "正在关闭"
					},
					"Key": "Launcher.STOPPING"
				},
				{
					"Source": {
						"Text": "SYSTEM"
					},
					"Translation": {
						"Text": "系统"
					},
					"Key": "Status.SYSTEM"
				},
				{
					"Source": {
						"Text": "SYSTEM DEGRADED"
					},
					"Translation": {
						"Text": "系统降级"
					},
					"Key": "Launcher.DEGRADED"
				},
				{
					"Source": {
						"Text": "SYSTEM DEGRADED"
					},
					"Translation": {
						"Text": "系统降级"
					},
					"Key": "Stage1.System.DEGRADED"
				},
				{
					"Source": {
						"Text": "SYSTEM ONLINE: N/A | {0} UAVs | {1} VIEW POSITIONS | {2} PLAYING | AI: NOT CONNECTED | {3}"
					},
					"Translation": {
						"Text": "系统在线：未知 | {0} 架无人机 | {1} 个显示位 | {2} 路播放中 | AI：未连接 | {3}"
					},
					"Key": "Video.System"
				},
				{
					"Source": {
						"Text": "SYSTEM READY"
					},
					"Translation": {
						"Text": "系统就绪"
					},
					"Key": "Launcher.READY"
				},
				{
					"Source": {
						"Text": "SYSTEM READY"
					},
					"Translation": {
						"Text": "系统就绪"
					},
					"Key": "Stage1.System.READY"
				},
				{
					"Source": {
						"Text": "Save and exit"
					},
					"Translation": {
						"Text": "保存并退出"
					},
					"Key": "Workflow.SaveExit"
				},
				{
					"Source": {
						"Text": "Save draft"
					},
					"Translation": {
						"Text": "保存草稿"
					},
					"Key": "Workflow.SaveDraft"
				},
				{
					"Source": {
						"Text": "Saved · editing continues"
					},
					"Translation": {
						"Text": "已保存 · 可继续编辑"
					},
					"Key": "Map.SAVED"
				},
				{
					"Source": {
						"Text": "Scheduled mission starts in {0}"
					},
					"Translation": {
						"Text": "定时任务将在 {0} 后启动"
					},
					"Key": "Schedule.Countdown"
				},
				{
					"Source": {
						"Text": "Scheduled start (unchecked: start now)"
					},
					"Translation": {
						"Text": "定时启动（不勾选：立即启动）"
					},
					"Key": "Schedule.Enable"
				},
				{
					"Source": {
						"Text": "Scheduled: {0} | Starts in {1} | {2} UAV"
					},
					"Translation": {
						"Text": "定时任务：{0} | 距启动 {1} | {2} 架无人机"
					},
					"Key": "Schedule.Overview"
				},
				{
					"Source": {
						"Text": "Security Plans"
					},
					"Translation": {
						"Text": "安保方案"
					},
					"Key": "Nav.Plans"
				},
				{
					"Source": {
						"Text": "Select a UAV here or on the map."
					},
					"Translation": {
						"Text": "在列表或地图中选择无人机。"
					},
					"Key": "Map.Select"
				},
				{
					"Source": {
						"Text": "Select a registered UAV video target."
					},
					"Translation": {
						"Text": "请选择已注册的无人机视频目标。"
					},
					"Key": "Errors.INVALID_VIDEO_TARGET"
				},
				{
					"Source": {
						"Text": "Select a waypoint to edit height and hover time"
					},
					"Translation": {
						"Text": "选择航点以编辑高度和悬停时间"
					},
					"Key": "Mission3D.SelectPoint"
				},
				{
					"Source": {
						"Text": "Select the Map window or use Launcher Focus."
					},
					"Translation": {
						"Text": "请选择 Map 窗口，或使用 Launcher 的聚焦按钮。"
					},
					"Key": "Errors.MAP_FOCUS_MANUAL"
				},
				{
					"Source": {
						"Text": "Selected UAVs: {0} | Preserve relative offsets | Minimum separation: {1} m"
					},
					"Translation": {
						"Text": "已选无人机：{0} | 保持相对队形 | 最小间距：{1} 米"
					},
					"Key": "Group.Summary"
				},
				{
					"Source": {
						"Text": "Selected Waypoint: P{0}"
					},
					"Translation": {
						"Text": "当前选中航点：P{0}"
					},
					"Key": "Mission3D.Selected"
				},
				{
					"Source": {
						"Text": "Shutdown System"
					},
					"Translation": {
						"Text": "关闭系统"
					},
					"Key": "Launcher.Shutdown"
				},
				{
					"Source": {
						"Text": "Simulation preflight checks deployment, route, Mock UAV availability and execution conflicts. Backend confirms every action."
					},
					"Translation": {
						"Text": "模拟执行检查部署、航线、Mock UAV 可用性及任务冲突；所有操作以 Backend 确认为准。"
					},
					"Key": "Execution.MockCheck"
				},
				{
					"Source": {
						"Text": "Simulation preflight passed · {uav_id}"
					},
					"Translation": {
						"Text": "模拟执行检查通过 · {uav_id}"
					},
					"Key": "Events.PREFLIGHT_PASSED"
				},
				{
					"Source": {
						"Text": "Simulation preflight started · {uav_id}"
					},
					"Translation": {
						"Text": "开始模拟执行检查 · {uav_id}"
					},
					"Key": "Events.PREFLIGHT_STARTED"
				},
				{
					"Source": {
						"Text": "Spacing must meet the configured minimum separation."
					},
					"Translation": {
						"Text": "间距必须满足配置的最小安全距离。"
					},
					"Key": "Errors.INVALID_SEPARATION"
				},
				{
					"Source": {
						"Text": "Speed (m/s; 0 = default)"
					},
					"Translation": {
						"Text": "速度 (m/s；0 为默认)"
					},
					"Key": "Inspector.Speed"
				},
				{
					"Source": {
						"Text": "Start Mission →"
					},
					"Translation": {
						"Text": "开始任务 →"
					},
					"Key": "Execution.Start"
				},
				{
					"Source": {
						"Text": "Starting mission…"
					},
					"Translation": {
						"Text": "正在启动任务…"
					},
					"Key": "Execution.STARTING"
				},
				{
					"Source": {
						"Text": "Stop"
					},
					"Translation": {
						"Text": "停止"
					},
					"Key": "Launcher.Stop"
				},
				{
					"Source": {
						"Text": "Stored execution belongs to a different adapter. Create a new execution."
					},
					"Translation": {
						"Text": "已保存执行属于另一种适配器，请创建新的执行。"
					},
					"Key": "Errors.ADAPTER_MODE_MISMATCH"
				},
				{
					"Source": {
						"Text": "Switch to Map / Retry"
					},
					"Translation": {
						"Text": "切换到 Map / 重试"
					},
					"Key": "Workflow.ReturnMap"
				},
				{
					"Source": {
						"Text": "Synchronization failed. Last confirmed state retained."
					},
					"Translation": {
						"Text": "同步失败，保留最后确认状态。"
					},
					"Key": "Errors.SYNC_FAILED"
				},
				{
					"Source": {
						"Text": "TACTICAL DATA"
					},
					"Translation": {
						"Text": "无人机态势"
					},
					"Key": "Command.Tactical"
				},
				{
					"Source": {
						"Text": "TACTICAL MAP"
					},
					"Translation": {
						"Text": "战术地图"
					},
					"Key": "Stage1.Map"
				},
				{
					"Source": {
						"Text": "TARGET UAV {0} | {1}"
					},
					"Translation": {
						"Text": "目标无人机 {0} | {1}"
					},
					"Key": "Alarm.Target"
				},
				{
					"Source": {
						"Text": "TOGGLE FOLLOW SELECTED UAV"
					},
					"Translation": {
						"Text": "切换跟随选中无人机"
					},
					"Key": "Situation.Follow"
				},
				{
					"Source": {
						"Text": "Task"
					},
					"Translation": {
						"Text": "任务"
					},
					"Key": "Plan.Mission"
				},
				{
					"Source": {
						"Text": "Task 01"
					},
					"Translation": {
						"Text": "任务 01"
					},
					"Key": "Workflow.DefaultTask"
				},
				{
					"Source": {
						"Text": "Task configuration"
					},
					"Translation": {
						"Text": "任务配置"
					},
					"Key": "Workflow.TaskConfig"
				},
				{
					"Source": {
						"Text": "Task configured: {mission_name} · {uav_id}"
					},
					"Translation": {
						"Text": "任务已配置：{mission_name} · {uav_id}"
					},
					"Key": "Events.MISSION_CONFIGURED"
				},
				{
					"Source": {
						"Text": "Task name"
					},
					"Translation": {
						"Text": "任务名称"
					},
					"Key": "Plan.MissionName"
				},
				{
					"Source": {
						"Text": "Task type: Patrol"
					},
					"Translation": {
						"Text": "任务类型：巡逻"
					},
					"Key": "Workflow.Patrol"
				},
				{
					"Source": {
						"Text": "Tasks"
					},
					"Translation": {
						"Text": "任务配置"
					},
					"Key": "Workflow.StepTask"
				},
				{
					"Source": {
						"Text": "Tasks: {0} | UAV assigned: {1} | Routes configured: {2}"
					},
					"Translation": {
						"Text": "任务：{0} | 已分配无人机：{1} | 已配置航线：{2}"
					},
					"Key": "Plan.Counts"
				},
				{
					"Source": {
						"Text": "Terrain height is unavailable or the waypoint is below ground. Load terrain and retry."
					},
					"Translation": {
						"Text": "地面高度尚不可用，或航点位于地面以下。请等待地形加载后重试。"
					},
					"Key": "Errors.TERRAIN_REQUIRED"
				},
				{
					"Source": {
						"Text": "The assigned UAV is not in the Registry."
					},
					"Translation": {
						"Text": "已分配无人机不在注册表中。"
					},
					"Key": "Errors.INVALID_UAV"
				},
				{
					"Source": {
						"Text": "The deployed route snapshot is missing."
					},
					"Translation": {
						"Text": "已部署航线快照缺失。"
					},
					"Key": "Errors.IMMUTABLE_ROUTE_MISSING"
				},
				{
					"Source": {
						"Text": "The live coordinate anchor changed. Recalibrate before control."
					},
					"Translation": {
						"Text": "实时坐标锚点已变化，控制前须重新标定。"
					},
					"Key": "Errors.REAL_ANCHOR_CHANGED_RECALIBRATE"
				},
				{
					"Source": {
						"Text": "The motion target or speed is invalid."
					},
					"Translation": {
						"Text": "运动目标或速度无效。"
					},
					"Key": "Errors.ADAPTER_COMMAND_INVALID"
				},
				{
					"Source": {
						"Text": "The real coordinate calibration is invalid."
					},
					"Translation": {
						"Text": "真实坐标标定无效。"
					},
					"Key": "Errors.REAL_ANCHOR_INVALID"
				},
				{
					"Source": {
						"Text": "The real mission is outside the supported local coordinate area."
					},
					"Translation": {
						"Text": "真实任务超出支持的局部坐标范围。"
					},
					"Key": "Errors.REAL_FRAME_DOMAIN_UNSUPPORTED"
				},
				{
					"Source": {
						"Text": "The route changed. Cancel and retry moving the plan."
					},
					"Translation": {
						"Text": "航线已发生变化，请取消后重新移动方案。"
					},
					"Key": "Errors.INVALID_TRANSLATION"
				},
				{
					"Source": {
						"Text": "The server rejected this request. Refresh and retry."
					},
					"Translation": {
						"Text": "服务器拒绝了此请求，请刷新后重试。"
					},
					"Key": "Errors.REQUEST_REJECTED"
				},
				{
					"Source": {
						"Text": "This UAV already has an active mission."
					},
					"Translation": {
						"Text": "此无人机已有正在执行的任务。"
					},
					"Key": "Errors.EXECUTION_CONFLICT"
				},
				{
					"Source": {
						"Text": "This UAV is assigned to another mission in this plan."
					},
					"Translation": {
						"Text": "此无人机已分配给该方案中的其他任务。"
					},
					"Key": "Errors.UAV_ALREADY_ASSIGNED"
				},
				{
					"Source": {
						"Text": "This action is unavailable in the current mission state."
					},
					"Translation": {
						"Text": "当前任务状态不允许此操作。"
					},
					"Key": "Errors.EXECUTION_STATE_INVALID"
				},
				{
					"Source": {
						"Text": "This client cannot perform this action."
					},
					"Translation": {
						"Text": "此客户端无权执行该操作。"
					},
					"Key": "Errors.ROLE_FORBIDDEN"
				},
				{
					"Source": {
						"Text": "This review confirms the current plan configuration. Deployment freezes the business configuration and does not start aircraft execution."
					},
					"Translation": {
						"Text": "本次审阅确认当前方案配置版本。部署只会冻结业务配置，不会启动无人机。"
					},
					"Key": "Plan.ReviewNotice"
				},
				{
					"Source": {
						"Text": "Trajectory conflict: aircraft cannot maintain the required separation."
					},
					"Translation": {
						"Text": "航迹冲突：无人机无法保持所需安全间距。"
					},
					"Key": "Errors.TRAJECTORY_CONFLICT"
				},
				{
					"Source": {
						"Text": "UAV DETAILS / ACTIONS"
					},
					"Translation": {
						"Text": "无人机详情 / 操作"
					},
					"Key": "Command.Details"
				},
				{
					"Source": {
						"Text": "UAV FLEET"
					},
					"Translation": {
						"Text": "机队态势"
					},
					"Key": "Command.Fleet"
				},
				{
					"Source": {
						"Text": "UAV Fleet"
					},
					"Translation": {
						"Text": "无人机"
					},
					"Key": "Nav.Fleet"
				},
				{
					"Source": {
						"Text": "UAV ONLINE: N/A\nAI ENGINE: NOT CONNECTED\nSTORAGE: N/A\nNETWORK: N/A"
					},
					"Translation": {
						"Text": "在线无人机：暂无\nAI 引擎：未连接\n存储：暂无\n网络：暂无"
					},
					"Key": "Video.ReservedStatus"
				},
				{
					"Source": {
						"Text": "UAV VIDEO MONITOR CENTER"
					},
					"Translation": {
						"Text": "无人机视频监看系统"
					},
					"Key": "Video.Title"
				},
				{
					"Source": {
						"Text": "UAV {0} | BAT {1}\nMISSION {2}"
					},
					"Translation": {
						"Text": "无人机 {0} | 电量 {1}\n任务 {2}"
					},
					"Key": "Fleet.Summary"
				},
				{
					"Source": {
						"Text": "UNASSIGN UAV"
					},
					"Translation": {
						"Text": "取消分配"
					},
					"Key": "Plan.Unassign"
				},
				{
					"Source": {
						"Text": "Undo"
					},
					"Translation": {
						"Text": "撤销"
					},
					"Key": "Workflow.Undo"
				},
				{
					"Source": {
						"Text": "Unknown"
					},
					"Translation": {
						"Text": "未知"
					},
					"Key": "Fleet.Unknown"
				},
				{
					"Source": {
						"Text": "Unknown altitude reference"
					},
					"Translation": {
						"Text": "未知高度基准"
					},
					"Key": "Errors.INVALID_ALTITUDE_REFERENCE"
				},
				{
					"Source": {
						"Text": "Unsaved route changes. Save, discard, or cancel before leaving."
					},
					"Translation": {
						"Text": "航线有未保存修改。离开前请选择保存、放弃或取消。"
					},
					"Key": "Map.DirtyPrompt"
				},
				{
					"Source": {
						"Text": "Unsupported language."
					},
					"Translation": {
						"Text": "不支持此语言。"
					},
					"Key": "Errors.INVALID_LANGUAGE"
				},
				{
					"Source": {
						"Text": "Use the security mission controls in Real mode."
					},
					"Translation": {
						"Text": "真实任务模式下请使用安保任务控制。"
					},
					"Key": "Errors.MISSION_CONTROLLER_OWNS_CONTROL"
				},
				{
					"Source": {
						"Text": "VIDEO INTELLIGENCE"
					},
					"Translation": {
						"Text": "视频情报"
					},
					"Key": "Stage1.Video"
				},
				{
					"Source": {
						"Text": "VIDEO SLOT\nNO ACTIVE STREAM"
					},
					"Translation": {
						"Text": "视频格位\n无活动视频流"
					},
					"Key": "Status.VIDEO_SLOT_NO_ACTIVE_STREAM"
				},
				{
					"Source": {
						"Text": "VIDEO TARGET"
					},
					"Translation": {
						"Text": "视频目标"
					},
					"Key": "Video.Target"
				},
				{
					"Source": {
						"Text": "VIEW ACTIVE UAV VIDEO"
					},
					"Translation": {
						"Text": "查看当前无人机视频"
					},
					"Key": "Video.Active"
				},
				{
					"Source": {
						"Text": "VIEW ASSIGNED UAV VIDEO"
					},
					"Translation": {
						"Text": "查看任务无人机视频"
					},
					"Key": "Video.Assigned"
				},
				{
					"Source": {
						"Text": "Version conflict. Local draft retained. Discard and reload to resolve."
					},
					"Translation": {
						"Text": "版本冲突，本地草稿已保留。可放弃并重新载入以解决冲突。"
					},
					"Key": "Errors.VERSION_CONFLICT"
				},
				{
					"Source": {
						"Text": "View mission UAV video"
					},
					"Translation": {
						"Text": "查看任务无人机视频"
					},
					"Key": "Execution.Video"
				},
				{
					"Source": {
						"Text": "WARNING"
					},
					"Translation": {
						"Text": "警告"
					},
					"Key": "Alarm.Warning"
				},
				{
					"Source": {
						"Text": "WARNING"
					},
					"Translation": {
						"Text": "警告"
					},
					"Key": "Status.WARNING"
				},
				{
					"Source": {
						"Text": "Waiting for Backend confirmation..."
					},
					"Translation": {
						"Text": "等待后端确认…"
					},
					"Key": "Common.Waiting"
				},
				{
					"Source": {
						"Text": "Waiting for Registry"
					},
					"Translation": {
						"Text": "等待注册表数据"
					},
					"Key": "Command.Waiting"
				},
				{
					"Source": {
						"Text": "Waypoint Inspector"
					},
					"Translation": {
						"Text": "航点属性"
					},
					"Key": "Inspector.Title"
				},
				{
					"Source": {
						"Text": "Waypoint coordinates or parameters are invalid."
					},
					"Translation": {
						"Text": "航点坐标或参数无效。"
					},
					"Key": "Errors.INVALID_WAYPOINT"
				},
				{
					"Source": {
						"Text": "Waypoint reached · {uav_id}"
					},
					"Translation": {
						"Text": "已抵达航点 · {uav_id}"
					},
					"Key": "Events.WAYPOINT_REACHED"
				},
				{
					"Source": {
						"Text": "Waypoint {0}  ·  Height {1} m  ·  Speed {2} m/s"
					},
					"Translation": {
						"Text": "航点 {0}  ·  高度 {1} 米  ·  速度 {2} 米/秒"
					},
					"Key": "Workflow.Waypoint"
				},
				{
					"Source": {
						"Text": "Waypoints: {0}"
					},
					"Translation": {
						"Text": "航点数：{0}"
					},
					"Key": "Map.Count"
				},
				{
					"Source": {
						"Text": "{0}\nConfigured visual: {1}\nAircraft model is not supplied by Descriptor."
					},
					"Translation": {
						"Text": "{0}\n配置的外观：{1}\n无人机描述未提供实际机型。"
					},
					"Key": "Video.DescriptorTip"
				},
				{
					"Source": {
						"Text": "{0}\nModel: N/A | Link: {1}\n{2}\n{3}"
					},
					"Translation": {
						"Text": "{0}\n机型：暂无 | 连接：{1}\n{2}\n{3}"
					},
					"Key": "Video.Feed"
				},
				{
					"Source": {
						"Text": "{0}\n{1} · {2}\n{3}\nWaypoint {4} / {5} · {6}"
					},
					"Translation": {
						"Text": "{0}\n{1} · {2}\n{3}\n航点 {4} / {5} · {6}"
					},
					"Key": "Execution.Summary"
				},
				{
					"Source": {
						"Text": "{0}   |   CMD {1}   MAP {2}   VID {3}"
					},
					"Translation": {
						"Text": "{0}   |   指挥 {1}   地图 {2}   视频 {3}"
					},
					"Key": "Stage1.Health"
				},
				{
					"Source": {
						"Text": "{0}  {1}"
					},
					"Translation": {
						"Text": "{0}  {1}"
					},
					"Key": "Workflow.Step"
				},
				{
					"Source": {
						"Text": "{0}  |  {1}"
					},
					"Translation": {
						"Text": "{0}  |  {1}"
					},
					"Key": "Stage1.Identity"
				},
				{
					"Source": {
						"Text": "{0}  ·  Tasks: {1}\nLast modified: {2}"
					},
					"Translation": {
						"Text": "{0}  ·  任务：{1}\n最后修改：{2}"
					},
					"Key": "Workflow.PlanCard"
				},
				{
					"Source": {
						"Text": "{0} / {1} UTC {2}"
					},
					"Translation": {
						"Text": "{0} / {1} UTC {2}"
					},
					"Key": "Alarm.Severity"
				},
				{
					"Source": {
						"Text": "{0} / {1}: predicted {2} m; required {3} m. Execution blocked."
					},
					"Translation": {
						"Text": "{0} / {1}：预计间距 {2} 米，要求 {3} 米。已阻止执行。"
					},
					"Key": "Group.Conflict"
				},
				{
					"Source": {
						"Text": "{0} UAV | {1} ONLINE | {2} ALERTS"
					},
					"Translation": {
						"Text": "无人机 {0} | 在线 {1} | 告警 {2}"
					},
					"Key": "Command.Count"
				},
				{
					"Source": {
						"Text": "{0} | Camera: N/A | Resolution: {1} | FPS: {2} | {3}"
					},
					"Translation": {
						"Text": "{0} | 相机：暂无 | 分辨率：{1} | 帧率：{2} | {3}"
					},
					"Key": "Video.Details"
				},
				{
					"Source": {
						"Text": "{0} | UAV: {1} | Waypoints: {2}"
					},
					"Translation": {
						"Text": "{0} | 无人机：{1} | 航点数：{2}"
					},
					"Key": "Plan.MissionSummary"
				},
				{
					"Source": {
						"Text": "{0} | VIDEO TARGET: {1} | ACTIVE UAV: {2}"
					},
					"Translation": {
						"Text": "{0} | 视频目标：{1} | 当前无人机：{2}"
					},
					"Key": "Video.Header"
				},
				{
					"Source": {
						"Text": "{0} — new version"
					},
					"Translation": {
						"Text": "{0} — 新版本"
					},
					"Key": "Workflow.VersionName"
				},
				{
					"Source": {
						"Text": "{source} client connected"
					},
					"Translation": {
						"Text": "{source} 客户端已连接"
					},
					"Key": "Events.client_connected"
				},
				{
					"Source": {
						"Text": "{source} client disconnected"
					},
					"Translation": {
						"Text": "{source} 客户端已断开"
					},
					"Key": "Events.client_disconnected"
				},
				{
					"Source": {
						"Text": "{uav_id} assigned to mission {mission_name}"
					},
					"Translation": {
						"Text": "{uav_id} 已分配至任务 {mission_name}"
					},
					"Key": "Events.UAV_ASSIGNED"
				},
				{
					"Source": {
						"Text": "{uav_id}: immediate start requested"
					},
					"Translation": {
						"Text": "{uav_id}：已请求立即启动"
					},
					"Key": "Events.SCHEDULE_DUE"
				},
				{
					"Source": {
						"Text": "{uav_id}: motion paused by safety separation check"
					},
					"Translation": {
						"Text": "{uav_id}：安全距离检查已暂停移动"
					},
					"Key": "Events.SAFETY_CONFLICT"
				},
				{
					"Source": {
						"Text": "{uav_id}: scheduled mission cancelled"
					},
					"Translation": {
						"Text": "{uav_id}：定时任务已取消"
					},
					"Key": "Events.MISSION_CANCELLED"
				},
				{
					"Source": {
						"Text": "{uav_id}: scheduled mission started"
					},
					"Translation": {
						"Text": "{uav_id}：定时任务已启动"
					},
					"Key": "Events.SCHEDULE_STARTED"
				},
				{
					"Source": {
						"Text": "{uav_id}: start time updated"
					},
					"Translation": {
						"Text": "{uav_id}：启动时间已更新"
					},
					"Key": "Events.SCHEDULE_CHANGED"
				},
				{
					"Source": {
						"Text": "● ROUTE EDITING"
					},
					"Translation": {
						"Text": "● 航线编辑中"
					},
					"Key": "Workflow.RouteEditBanner"
				},
				{
					"Source": {
						"Text": "● {0}  {1}"
					},
					"Translation": {
						"Text": "● {0}  {1}"
					},
					"Key": "Workflow.ActiveStep"
				},
				{
					"Source": {
						"Text": "✓ Mock UAV configured"
					},
					"Translation": {
						"Text": "✓ 已配置 Mock UAV"
					},
					"Key": "Execution.MockAvailable"
				},
				{
					"Source": {
						"Text": "✓ Security plan deployed"
					},
					"Translation": {
						"Text": "✓ 安保方案已部署"
					},
					"Key": "Workflow.DeploymentSuccess"
				},
				{
					"Source": {
						"Text": "中文"
					},
					"Translation": {
						"Text": "中文"
					},
					"Key": "Workflow.Chinese"
				}
			]
		}
	]
}